Repository: rongcloud/callkit-ios
Catalog: ios-rongcallkit/RongCallKit/Resources/*.lproj/RongCallKit.strings
Languages: ar, zh_hans

# VoIPAudioCall
source: Voice Call
ar: مكالمة صوتية
zh_hans: 语音通话

# VoIPVideoCall
source: Video Call
ar: مكالمة فيديو
zh_hans: 视频通话

# VoIPAudioCallExistedWarning
source: Voice call is on. Try again later.
ar: مكالمة صوتية جارية , حاول مرة اخرى
zh_hans: 正在进行语音通话，请稍后再试

# VoIPVideoCallExistedWarning
source: Video call is on. Try again later.
ar: مكالمة فيديو جارية , حاول مرة اخرى
zh_hans: 正在进行视频通话，请稍后再试

# VoIPCallSelectMember
source: Select Members
ar: اختر الأعضاء
zh_hans: 选择成员

# VoIPAudioCallMaxNumSelectMember
source: Participants over limit, please try again later.
ar: تجاوز المشاركون الحد، يرجى المحاولة مرة أخرى في وقت لاحق.
zh_hans: 最多允许%d人同时语音通话

# VoIPVideoCallMaxNumSelectMember
source: Participants over limit, please try again later.
ar: تجاوز المشاركون الحد، يرجى المحاولة مرة أخرى في وقت لاحق.
zh_hans: 最多允许%d人同时视频通话

# VoIPCallEnd
source: Call ended
ar: انتهت المكالمة
zh_hans: 通话结束

# VoIPAudioCallCamera
source: Camera
ar: كاميرا
zh_hans: 摄像头

# VoIPVideoCallCloseCamera
source: Turn off camera
ar: اغلق الكاميرا
zh_hans: 关闭摄像头

# VoIPVideoCallOpenCamera
source: Turn on camera
ar: تشغيل الكاميرا
zh_hans: 开启摄像头

# VoIPVideoCallTurnToAudioCall
source: Switch to voice call
ar: حول إلى مكالمة صوتية
zh_hans: 语音通话

# VoIPCallHangup
source: Hang up
ar: إنهاء المحادثة
zh_hans: 挂断

# VoIPCallAccept
source: Accept
ar: قبول
zh_hans: 接听

# VoIPCallMute
source: Mute
ar: صامت
zh_hans: 静音

# VoIPCallSpeaker
source: Speaker
ar: مكبر صوت
zh_hans: 免提

# VoIPCallWaitingForRemoteAccept
source: Awaiting response...
ar: جاري الاتصال
zh_hans: 正在等待对方接受邀请...

# VoIPAudioCallIncoming
source: Invites you to voice call
ar: يدعوك إلى مكالمة صوتية
zh_hans: 邀请您进行语音通话...

# VoIPVideoCallIncoming
source: Invites you to video call
ar: يدعوك إلى مكالمة فيديو
zh_hans: 邀请您进行视频通话...

# VoIPAudioCallIncomingWithoutUserName
source: You've got a voice chat invitation
ar: لديك دعوة مكالمة صوتية
zh_hans: 您有一个语音通话邀请

# VoIPVideoCallIncomingWithoutUserName
source: You've got a video chat invitation
ar: لديك دعوة مكالمة فيديو
zh_hans: 您有一个视频通话邀请

# VoIPMultiCallUserCollectionTitle
source: Members
ar: اعضاء
zh_hans: 群聊成员

# VoIPCallTotalTime
source: Duration
ar: المدة
zh_hans: 通话时长

# VoIPCallHasEnd
source: Cancelled
ar: ألغيت
zh_hans: 已结束

# VoIPCallHasCancel
source: Cancelled
ar: تم الإلغاء
zh_hans: 已取消

# VoIPCallHasReject
source: Declined
ar: رفض
zh_hans: 已拒绝

# VoIPCallHasHangup
source: Hung-up
ar: تم إغلاق الخط
zh_hans: 已挂断

# VoIPCallBusyLine
source: Busy
zh_hans: 己方忙

# VoIPCallNoResponse
source: No answer
ar: لا يوجد إجابة
zh_hans: 未接听

# VoIPCallEngineUnsupport
source: Unsupport Engine
zh_hans: 己方不支持当前引擎

# VoIPCallLocalNetworkError
source: Interrupt
ar: تم الإلغاء
zh_hans: 本地网络错误

# VoIPCallLocalResourceError
source: Local get resource error
zh_hans: 己方获取媒体资源失败

# VoIPCallLocalPublishError
source: Local publish error
zh_hans: 己方发布资源失败

# VoIPCallLocalSubscribeError
source: Local subscribe error
zh_hans: 己方订阅资源失败

# VoIPCallLocalKickedByOtherCallError
source: Local kicked by other call error
zh_hans: 己方其他端已加入新通话

# VoIPCallLocalInOtherCallError
source: In other call error
zh_hans: 己方其他端已在通话中

# VoIPCallLocalKickedByServer
source: Kicked by server
zh_hans: 己方已被禁止通话

# VoIPCallLocalAcceptSystemCall
source: Local accept system call
zh_hans: 己方已接听系统来电

# VoIPCallRemoteCancel
source: Remote Cancelled
ar: تم الإلغاء
zh_hans: 对方已取消

# VoIPCallRemoteReject
source: Remote Declined
ar: رفض
zh_hans: 对方已拒绝

# VoIPCallRemoteHangup
source: Has Hung-up
ar: لقد أغلق الخط
zh_hans: 对方已挂断

# VoIPCallRemoteBusyLine
source: Busy line
ar: الخط مشغول
zh_hans: 对方忙

# VoIPCallRemoteNoResponse
source: Remote No answer
ar: لايوجد اجابة
zh_hans: 对方未接听

# VoIPCallRemoteEngineUnsupport
source: Unsupport Engine
zh_hans: 对方不支持当前引擎

# VoIPCallRemoteNetworkError
source: Interrupt
ar: تم الإلغاء
zh_hans: 对方网络错误

# VoIPCallRemoteResourceError
source: Remote get resource error
zh_hans: 对方获取媒体资源失败

# VoIPCallRemotePublishError
source: Remote publish error
zh_hans: 对方发布资源失败

# VoIPCallRemoteSubscribeError
source: Remote subscribe error
zh_hans: 对方订阅资源失败

# VoIPCallRemoteKickedByOtherCallError
source: Remote kicked by other call error
zh_hans: 对方其他端已加入新通话

# VoIPCallRemoteInOtherCallError
source: Remote kicked by other call error
zh_hans: 己方其他端已在通话中

# VoIPCallRemoteKickedByServer
source: Kicked by server
zh_hans: 对方已被禁止通话

# VoIPCallRemoteAcceptSystemCall
source: Remote accept system call
zh_hans: 对方已接听系统来电

# VoIPCallAcceptByOtherClient
source: Accepted by other client
ar: تم قبولها من طرف آخر
zh_hans: 己方其他端已接听

# VoIPCallHangupByOtherClient
source: Hanguped by other client
zh_hans: 己方其他端已挂断

# VoIP_Rejected_By_Blacklist
source: Has been blacklisted by receiver
ar: تم إضافتها إلى القائمة السوداء
zh_hans: 已被对方加入黑名单

# VoIPCallMediaServerClosed
source: Audio and video services are turned off
ar: خدمات الصوت والفيديو غير مفعله
zh_hans: 音视频服务已关闭

# VoIPCallRemoteBusyLineAndShowAdvice
source: The other user may be busy now, Try again later.
ar: قد يكون المستخدم الآخر مشغول الآن , حاول مرة اخرى .
zh_hans: 对方忙，请稍后再拨

# VoIPCallRemoteDidInvite
source: %@ has joined the group chat
ar: انضم %@ لمجموعة المحادثة
zh_hans: %@ 加入群聊

# bottom_result_view_choosed_person_prefix
source: Selected
ar: مختار
zh_hans: 已选择

# bottom_result_view_choosed_person_subfix
source: member(s)
ar: عضو/اعضاء
zh_hans: 人

source: cancel
ar: الإلغاء
zh_hans: 取消

source: ok
ar: حسناً
zh_hans: 确定

source: Connecting...
ar: جاري الإتصال...
zh_hans: 连接中...

# voip_network_bad
source: Network is unstable
ar: الشبكة غير مستقرة
zh_hans: 当前通话网络不佳

# AccessRightTitle
source: no access right
ar: لاتوجد صلاحية
zh_hans: 无法访问

# speakerAccessRight
source: You don't have microphone access, please go to "Settings - Privacy - Microphone" to allow access to your microphone!
ar: لم تقم بإعطاء صلاحية للسماعة، يرجى تحديدها في الإعدادات
zh_hans: 您没有麦克风访问权限，请前往“设置-隐私-麦克风”选项中，允许访问您的手机麦克风!

# cameraAccessRight
source: You don't have camera access, please go to "Settings - Privacy - Camera" to allow access to your camera!
ar: لم تقم بإعطاء صلاحيةللمايكروفون يرجى تحديدها في الإعدادات
zh_hans: 您没有相机访问权限，请前往“设置-隐私-相机”选项中，允许访问您的手机相机!

# receive_new_message
source: You got a new message
ar: توجد رسالة جديدة
zh_hans: 你收到一条新消息

# LocalNotificationShow
source: Show
ar: عرض
zh_hans: 显示

# VoIPCall_search_placeholder
source: Search
ar: بحث
zh_hans: 搜索

# VoIPCall_invite_audio_push_Content
source: Invites you to voice call
ar: يدعوك إلى مكالمة صوتية
zh_hans: %@邀请你进行语音聊天

# VoIPCall_invite_video_push_Content
source: Invites you to video call
ar: يدعوك إلى مكالمة فيديو
zh_hans: %@邀请你进行视频聊天

# VoIPCall_hangup_PushContent
source: [Call ended]
ar: [تم إنهاء المكالمة]
zh_hans: [结束通话]

# VoIPCall_addMembers
source: Select Members
ar: اختر الأعضاء
zh_hans: 添加成员

# VoIPCall_whiteBoard
source: white board
ar: السبورة البيضاء
zh_hans: 白板

# VoIPCall_hand_raise
source: Raise hand to speak
ar: ارفع يدك للتحدث
zh_hans: 举手发言

# VoIPCallMaxNumInviteMember
source: Up to %d members
ar: Up to %d اعضاء

source: Confirm
ar: تأكيد

# voip_network_bad_laterTry
source: Network is unavailable, please check your network
ar: الشبكة غير متوفرة، يرجى التحقق من شبكتك

# bottom_result_view_choosed_person
source: %zi members selected
ar: تم اختيار %zi أشخاص

# VoIPCallDoSomethingByOtherClient
source: Other devices have been answered
ar: تم الرد على الأجهزة الأخرى .

source: Other user switched to voice call
ar: المستخدم الآخر حول المكالمة الى مكالمة صوتية

source: Switched to voice call
ar: حول إلى مكالمة صوتية
